<p style="text-align:center">
    <a href="https://skills.network/?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2022-01-01" target="_blank">
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/assets/logos/SN_web_lightmode.png" width="200" alt="Skills Network Logo"  />
    </a>
</p>

<h1 align=center><font size = 5>Assignment: SQL Notebook for Peer Assignment</font></h1>

Estimated time needed: **60** minutes.

## Introduction

Using this Python notebook you will:

1.  Understand the Spacex DataSet
2.  Load the dataset  into the corresponding table in a Db2 database
3.  Execute SQL queries to answer assignment questions

## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones.

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage.

Therefore if we can determine if the first stage will land, we can determine the cost of a launch.

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

### Download the datasets

This assignment requires you to load the spacex dataset.

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. Click on the link below to download and save the dataset (.CSV file):

<a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2022-01-01" target="_blank">Spacex DataSet</a>

### Store the dataset in database table

**it is highly recommended to manually load the table using the database console LOAD tool in DB2**.

<img src = "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/images/spacexload.png">

Now open the Db2 console, open the LOAD tool, Select / Drag the .CSV file for the  dataset, Next create a New Table, and then follow the steps on-screen instructions to load the data. Name the new table as follows:

**SPACEXDATASET**

**Follow these steps while using old DB2 UI which is having Open Console Screen**

**Note:While loading Spacex dataset, ensure that detect datatypes is disabled. Later click on the pencil icon(edit option).**

1.  Change the Date Format by manually typing DD-MM-YYYY and timestamp format as DD-MM-YYYY HH\:MM:SS

2.  Change the PAYLOAD_MASS\_\_KG\_  datatype  to INTEGER.

<img src = "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/images/spacexload2.png">

**Changes to be considered when having DB2 instance with the new UI having Go to UI screen**

*   Refer to this insruction in this <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sign%20up%20for%20IBM%20Cloud%20-%20Create%20Db2%20service%20instance%20-%20Get%20started%20with%20the%20Db2%20console/instructional-labs.md.html?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2022-01-01">link</a> for viewing  the new  Go to UI screen.

*   Later click on **Data link(below SQL)**  in the Go to UI screen  and click on **Load Data** tab.

*   Later browse for the downloaded spacex file.

<img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/images/browsefile.png" width="800"/>

*   Once done select the schema andload the file.

 <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/images/spacexload3.png" width="800"/>

In [ ]:
!pip install sqlalchemy==1.3.9

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [1]:
%load_ext sql

In [2]:
import csv, sqlite3

con = sqlite3.connect("my_data1.db")
cur = con.cursor()

In [ ]:
!pip install -q pandas==1.1.5

In [3]:
%sql sqlite:///my_data1.db

In [4]:
import pandas as pd
df = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv")
df.to_sql("SPACEXTBL", con, if_exists='replace', index=False,method="multi")

101

In [ ]:
### TO JSEM VLOŽIL JA, PUVODNĚ SE POUŽIVA DTB V BUNCE VÝŠE. ZDE TO JE PROSTĚ JAKO KDYBY NAHODOU JSEM SI CHTĚL DATA STAHNOUT ZE SVE DATABAZE


#%sql ibm_db_sa://cps79179:HdtAZQg7iNxba6cI@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/BLUDB?security=SSL

## Tasks

Now write and execute SQL queries to solve the assignment tasks.

**Note: If the column names are in mixed case enclose it in double quotes
For Example "Landing_Outcome"**

### Task 1

##### Display the names of the unique launch sites  in the space mission

In [6]:
%%sql
SELECT DISTINCT Payload FROM SPACEXTBL

 * sqlite:///my_data1.db
Done.

[('Dragon Spacecraft Qualification Unit',),
 ('Dragon demo flight C1, two CubeSats, barrel of Brouere cheese',),
 ('Dragon demo flight C2',),
 ('SpaceX CRS-1',),
 ('SpaceX CRS-2',),
 ('CASSIOPE',),
 ('SES-8',),
 ('Thaicom 6',),
 ('SpaceX CRS-3',),
 ('OG2 Mission 1  6 Orbcomm-OG2 satellites',),
 ('AsiaSat 8',),
 ('AsiaSat 6',),
 ('SpaceX CRS-4',),
 ('SpaceX CRS-5',),
 ('DSCOVR',),
 ('ABS-3A Eutelsat 115 West B',),
 ('SpaceX CRS-6',),
 ('Turkmen 52 / MonacoSAT',),
 ('SpaceX CRS-7',),
 ('OG2 Mission 2  11 Orbcomm-OG2 satellites',),
 ('Jason-3',),
 ('SES-9',),
 ('SpaceX CRS-8',),
 ('JCSAT-14',),
 ('Thaicom 8',),
 ('ABS-2A Eutelsat 117 West B',),
 ('SpaceX CRS-9',),
 ('JCSAT-16',),
 ('Iridium NEXT 1',),
 ('SpaceX CRS-10',),
 ('EchoStar 23',),
 ('SES-10',),
 ('NROL-76',),
 ('Inmarsat-5 F4',),
 ('SpaceX CRS-11',),
 ('BulgariaSat-1',),
 ('Iridium NEXT 2',),
 ('Intelsat 35e',),
 ('SpaceX CRS-12',),
 ('Formosat-5',),
 ('Boeing X-37B OTV-5',),
 ('Iridium NEXT 3',),
 ('SES-11 / EchoStar 105',),
 ('Koreasat 5A',),
 ('SpaceX CRS-13',),
 ('Iridium NEXT 4',),
 ('Zuma',),
 ('GovSat-1 / SES-16',),
 ('Paz  Tintin A & B',),
 ('Hispasat 30W-6  PODSat',),
 ('Iridium NEXT 5',),
 ('SpaceX CRS-14',),
 ('Transiting Exoplanet Survey Satellite (TESS)',),
 ('Bangabandhu-1',),
 ('Iridium NEXT 6   GRACE-FO 1, 2',),
 ('SES-12',),
 ('SpaceX CRS-15',),
 ('Telstar 19V',),
 ('Iridium NEXT-7',),
 ('Merah Putih ',),
 ('Telstar 18V / Apstar-5C',),
 ('SAOCOM 1A',),
 ('Es hail 2',),
 ('SSO-A ',),
 ('SpaceX CRS-16',),
 ('GPS III-01 ',),
 ('Iridium NEXT-8',),
 ('Nusantara Satu, Beresheet Moon lander, S5',),
 ('Crew Dragon Demo-1, SpaceX CRS-17 ',),
 ('SpaceX CRS-17, Starlink v0.9',),
 ('Starlink v0.9, RADARSAT Constellation',),
 ('RADARSAT Constellation, SpaceX CRS-18 ',),
 ('SpaceX CRS-18, AMOS-17 ',),
 ('AMOS-17, Starlink 1 v1.0 ',),
 ('Starlink 1 v1.0, SpaceX CRS-19 ',),
 ('SpaceX CRS-19, JCSat-18 / Kacific 1 ',),
 ('JCSat-18 / Kacific 1, Starlink 2 v1.0 ',),
 ('Starlink 2 v1.0, Crew Dragon in-flight abort test ',),
 ('Crew Dragon in-flight abort test, Starlink 3 v1.0 ',),
 ('Starlink 3 v1.0, Starlink 4 v1.0 ',),
 ('Starlink 4 v1.0, SpaceX CRS-20',),
 ('SpaceX CRS-20, Starlink 5 v1.0 ',),
 ('Starlink 5 v1.0, Starlink 6 v1.0 ',),
 ('Starlink 6 v1.0, Crew Dragon Demo-2 ',),
 ('Crew Dragon Demo-2, Starlink 7 v1.0 ',),
 ('Starlink 7 v1.0, Starlink 8 v1.0',),
 ('Starlink 8 v1.0, SkySats-16, -17, -18, GPS III-03 ',),
 ('GPS III-03, ANASIS-II',),
 ('ANASIS-II, Starlink 9 v1.0',),
 ('Starlink 9 v1.0, SXRS-1, Starlink 10 v1.0 ',),
 ('Starlink 10 v1.0, SkySat-19, -20, -21, SAOCOM 1B ',),
 ('SAOCOM 1B, GNOMES 1, Tyvak-0172',),
 ('Starlink 11 v1.0, Starlink 12 v1.0 ',),
 ('Starlink 12 v1.0, Starlink 13 v1.0 ',),
 ('Starlink 13 v1.0, Starlink 14 v1.0 ',),
 ('Starlink 14 v1.0, GPS III-04  ',),
 ('GPS III-04 , Crew-1',),
 ('Crew-1, Sentinel-6 Michael Freilich ',),
 ('Sentinel-6 Michael Freilich, Starlink 15 v1.0 ',),
 ('Starlink 15 v1.0, SpaceX CRS-21',),
 ('SpaceX CRS-21',)]

### Task 2

##### Display 5 records where launch sites begin with the string 'CCA'

In [14]:
%%sql 
SELECT * FROM SPACEXTBL WHERE lower(Launch_Site) LIKE 'cca%' LIMIT 5

 * sqlite:///my_data1.db
Done.

[('04-06-2010', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 ('08-12-2010', '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 ('22-05-2012', '07:44:00', 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'),
 ('08-10-2012', '00:35:00', 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 ('01-03-2013', '15:10:00', 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt')]

### Task 3

##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [119]:
%%sql
/*SELECT count(*) as num_of_observation FROM SPACEXTBL;*/
SELECT sum(PAYLOAD_MASS__KG_) as num_of_payload_mass FROM SPACEXTBL where Customer = "NASA (CRS)";

 * sqlite:///my_data1.db
Done.

[(45596,)]

### Task 4

##### Display average payload mass carried by booster version F9 v1.1

In [38]:
%%sql
SELECT avg(PAYLOAD_MASS__KG_) as avg_of_payload_mass FROM SPACEXTBL WHERE lower(Booster_Version) LIKE '%1.1%'

 * sqlite:///my_data1.db
Done.

[(3890.05,)]

### Task 5

##### List the date when the first succesful landing outcome in ground pad was acheived.

*Hint:Use min function*

In [118]:
%%sql
/*max jsem musel vlozit, protoze date neni ve formatu date ale string a vychazi to zcela nahodně*/
SELECT max(Date) as Date, "Landing _Outcome" FROM SPACEXTBL WHERE "Landing _Outcome" = 'Success (ground pad)'

 * sqlite:///my_data1.db
Done.

[('22-12-2015', 'Success (ground pad)')]

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [123]:
%%sql 
SELECT  DISTINCT "Landing _Outcome" FROM SPACEXTBL

 * sqlite:///my_data1.db
Done.

[('Failure (parachute)',),
 ('No attempt',),
 ('Uncontrolled (ocean)',),
 ('Controlled (ocean)',),
 ('Failure (drone ship)',),
 ('Precluded (drone ship)',),
 ('Success (ground pad)',),
 ('Success (drone ship)',),
 ('Success',),
 ('Failure',),
 ('No attempt ',)]

In [129]:
%%sql
SELECT Booster_Version, "Landing _Outcome", PAYLOAD_MASS__KG_ FROM SPACEXTBL 
WHERE 
lower("Landing _Outcome") LIKE '%Success (drone ship)%' AND 
PAYLOAD_MASS__KG_>4000 AND 
PAYLOAD_MASS__KG_<6000;

 * sqlite:///my_data1.db
Done.

[('F9 FT B1022', 'Success (drone ship)', 4696),
 ('F9 FT B1026', 'Success (drone ship)', 4600),
 ('F9 FT  B1021.2', 'Success (drone ship)', 5300),
 ('F9 FT  B1031.2', 'Success (drone ship)', 5200)]

### Task 7

##### List the total number of successful and failure mission outcomes

In [130]:
%%sql 
SELECT  DISTINCT Mission_Outcome FROM SPACEXTBL

 * sqlite:///my_data1.db
Done.

[('Success',),
 ('Failure (in flight)',),
 ('Success (payload status unclear)',),
 ('Success ',)]

In [136]:
%%sql 
SELECT count(Mission_Outcome) as num, Mission_Outcome FROM SPACEXTBL group by Mission_Outcome

 * sqlite:///my_data1.db
Done.

[(1, 'Failure (in flight)'),
 (98, 'Success'),
 (1, 'Success '),
 (1, 'Success (payload status unclear)')]

In [137]:
%%sql 
SELECT count("Landing _Outcome") as num, "Landing _Outcome" FROM SPACEXTBL group by "Landing _Outcome"

 * sqlite:///my_data1.db
Done.

[(5, 'Controlled (ocean)'),
 (3, 'Failure'),
 (5, 'Failure (drone ship)'),
 (2, 'Failure (parachute)'),
 (21, 'No attempt'),
 (1, 'No attempt '),
 (1, 'Precluded (drone ship)'),
 (38, 'Success'),
 (14, 'Success (drone ship)'),
 (9, 'Success (ground pad)'),
 (2, 'Uncontrolled (ocean)')]

### Task 8

##### List the   names of the booster_versions which have carried the maximum payload mass. Use a subquery

In [141]:
%%sql
SELECT Booster_Version,PAYLOAD_MASS__KG_ FROM SPACEXTBL WHERE PAYLOAD_MASS__KG_ = (SELECT MAX(PAYLOAD_MASS__KG_) FROM SPACEXTBL);

 * sqlite:///my_data1.db
Done.

[('F9 B5 B1048.4', 15600),
 ('F9 B5 B1049.4', 15600),
 ('F9 B5 B1051.3', 15600),
 ('F9 B5 B1056.4', 15600),
 ('F9 B5 B1048.5', 15600),
 ('F9 B5 B1051.4', 15600),
 ('F9 B5 B1049.5', 15600),
 ('F9 B5 B1060.2 ', 15600),
 ('F9 B5 B1058.3 ', 15600),
 ('F9 B5 B1051.6', 15600),
 ('F9 B5 B1060.3', 15600),
 ('F9 B5 B1049.7 ', 15600)]

### Task 9

##### List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.

**Note: SQLLite does not support monthnames. So you need to use  substr(Date, 4, 2) as month to get the months and substr(Date,7,4)='2015' for year.**

In [17]:
%%sql 
SELECT Date, substr(Date, 4, 2) as "month names", "Landing _Outcome", Booster_Version, Launch_Site FROM SPACEXTBL 
where "Landing _Outcome" = "Failure (drone ship)" AND substr(Date,7,4)='2015'

 * sqlite:///my_data1.db
Done.

[('10-01-2015', '01', 'Failure (drone ship)', 'F9 v1.1 B1012', 'CCAFS LC-40'),
 ('14-04-2015', '04', 'Failure (drone ship)', 'F9 v1.1 B1015', 'CCAFS LC-40')]

### Task 10

##### Rank the  count of  successful landing_outcomes between the date 04-06-2010 and 20-03-2017 in descending order.

In [54]:
%%sql 
/*Jeden zpusob multi podminky pro string*/
/*SELECT "Landing _Outcome" FROM SPACEXTBL WHERE "Landing _Outcome" IN ('Success','Success (drone ship)','Success (ground pad)')*/

SELECT CAST(substr(Date,7,4) as date) as datum, Date, "Landing _Outcome" FROM SPACEXTBL WHERE "Landing _Outcome" LIKE '%Success%'AND ( datum >= '2010' AND datum <= '2017')
ORDER BY datum DESC

 * sqlite:///my_data1.db
Done.

[(2017, '14-01-2017', 'Success (drone ship)'),
 (2017, '19-02-2017', 'Success (ground pad)'),
 (2017, '30-03-2017', 'Success (drone ship)'),
 (2017, '01-05-2017', 'Success (ground pad)'),
 (2017, '03-06-2017', 'Success (ground pad)'),
 (2017, '23-06-2017', 'Success (drone ship)'),
 (2017, '25-06-2017', 'Success (drone ship)'),
 (2017, '14-08-2017', 'Success (ground pad)'),
 (2017, '24-08-2017', 'Success (drone ship)'),
 (2017, '07-09-2017', 'Success (ground pad)'),
 (2017, '09-10-2017', 'Success (drone ship)'),
 (2017, '11-10-2017', 'Success (drone ship)'),
 (2017, '30-10-2017', 'Success (drone ship)'),
 (2017, '15-12-2017', 'Success (ground pad)'),
 (2016, '08-04-2016', 'Success (drone ship)'),
 (2016, '06-05-2016', 'Success (drone ship)'),
 (2016, '27-05-2016', 'Success (drone ship)'),
 (2016, '18-07-2016', 'Success (ground pad)'),
 (2016, '14-08-2016', 'Success (drone ship)'),
 (2015, '22-12-2015', 'Success (ground pad)')]

In [50]:
%%sql 
SELECT count(*), CAST(substr(Date,7,4) as date) as datum, Date, "Landing _Outcome" FROM SPACEXTBL WHERE "Landing _Outcome" LIKE '%Success%'AND ( datum >= '2010' AND datum <= '2017')
GROUP BY "Landing _Outcome"
ORDER BY datum DESC

 * sqlite:///my_data1.db
Done.

[(2016, '08-04-2016', 'Success (drone ship)'),
 (2015, '22-12-2015', 'Success (ground pad)')]

In [61]:
%%sql
/*Neco navíc*/ 
SELECT count(Launch_Site),Launch_Site FROM SPACEXTBL group by Launch_Site

 * sqlite:///my_data1.db
Done.

[(26, 'CCAFS LC-40'),
 (34, 'CCAFS SLC-40'),
 (25, 'KSC LC-39A'),
 (16, 'VAFB SLC-4E')]

### Reference Links

*   <a href ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20String%20Patterns%20-%20Sorting%20-%20Grouping/instructional-labs.md.html?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2022-01-01&origin=www.coursera.org">Hands-on Lab : String Patterns, Sorting and Grouping</a>

*   <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Built-in%20functions%20/Hands-on_Lab__Built-in_Functions.md.html?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2022-01-01&origin=www.coursera.org">Hands-on Lab: Built-in functions</a>

*   <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/instructional-labs.md.html?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2022-01-01&origin=www.coursera.org">Hands-on Lab : Sub-queries and Nested SELECT Statements</a>

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-3-SQLmagic.ipynb?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2022-01-01">Hands-on Tutorial: Accessing Databases with SQL magic</a>

*   <a href= "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-4-Analyzing.ipynb?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2022-01-01">Hands-on Lab: Analyzing a real World Data Set</a>

## Author(s)

<h4> Lakshmi Holla </h4>

## Other Contributors

<h4> Rav Ahuja </h4>

## Change log

| Date       | Version | Changed by    | Change Description        |
| ---------- | ------- | ------------- | ------------------------- |
| 2021-07-09 | 0.2     | Lakshmi Holla | Changes made in magic sql |
| 2021-05-20 | 0.1     | Lakshmi Holla | Created Initial Version   |

## <h3 align="center"> © IBM Corporation 2021. All rights reserved. <h3/>